// Виведіть в консоль числа від 1 до n використовуючи цикл for. (Дано: n = 10)
let result = 0
let n = 10
for (i = 1; n < 10; i++) {
    result = result + i
    console.log(result)
}
console.log('Hello')
// Напишіть цикл, який обчислює суму чисел від 1 до n. (Дано: n = 100)

// Використовуючи цикл while, виведіть в консоль числа від n до 1. (Дано: n = 10)

// Напишіть цикл, який виводить всі парні числа від 1 до n. (Дано: n = 50)

// Виведіть в консоль таблицю множення від 1 до n використовуючи вкладені цикли. (Дано: n = 10)

// Обчисліть факторіал числа n, використовуючи цикл. (Дано: n = 7)

// Виведіть перші n чисел послідовності Фібоначчі. (Дано: n = 10)

// Виведіть всі прості числа від 1 до n. (Дано: n = 100)

// Створіть масив чисел від 1 до n, а потім виведіть тільки ті числа, що діляться на 5 без остачі. (Дано: n = 100)

// Дано масив чисел. Обчисліть суму чисел в цьому масиві. (Дано: масив = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10])